[M_EllieDress MissionDefinition]
MissionDescription="Ellie Swords is responsible for protecting the city [place]Holy Ghost Flamerock[-place]. Unfortunately, he doesn't have the basic requirements for intelligence, a weapon. Please register [place]dark forest[-place] And you have something to keep."
TeaserText="Better protection..."

[M_EllieDress:EllieDress_FindLessSexyArmor MissionObjectiveDefinition]
ProgressMessage="search for beautiful weapons"

[M_EllieDress:EllieDress_OS_TurnInChoice MissionObjectiveSetBranchingDefinition]
MissionDescriptionOverride="Ellie Swords is responsible for protecting the city [place]Holy Ghost Flamerock[-place]. Unfortunately, he doesn't have the basic requirements for intelligence, a weapon. Please register [place]dark forest[-place] And you have something to keep. As it turns out, you found two different sets of armor -- one skimpy, one bulky. You get to choose which set to give to Ellie."
